raspberrypi/linux/drivers/net/wireless/realtek/rtl8723bu/os_dep/ioctl_linux.c
		}

		goto FREE_EXT;

	}

	if(	len >= WEXT_CSCAN_HEADER_SIZE
		&& _rtw_memcmp(ext, WEXT_CSCAN_HEADER, WEXT_CSCAN_HEADER_SIZE) == _TRUE
	){
		ret = rtw_wx_set_scan(dev, info, awrq, ext);
		goto FREE_EXT;
	}

#ifdef CONFIG_ANDROID
	//DBG_871X("rtw_wx_set_priv: %s req=%s\n", dev->name, ext);

	i = rtw_android_cmdstr_to_num(ext);

	switch(i) {
		case ANDROID_WIFI_CMD_START :
			indicate_wx_custom_event(padapter, "START");
			break;
		case ANDROID_WIFI_CMD_STOP :
			indicate_wx_custom_event(padapter, "STOP");
			break;
		case ANDROID_WIFI_CMD_RSSI :
			{
				struct	mlme_priv	*pmlmepriv = &(padapter->mlmepriv);
				struct	wlan_network	*pcur_network = &pmlmepriv->cur_network;

				if(check_fwstate(pmlmepriv, _FW_LINKED) == _TRUE) {
					sprintf(ext, "%s rssi %d", pcur_network->network.Ssid.Ssid, padapter->recvpriv.rssi);
				} else {
					sprintf(ext, "OK");
				}
			}
			break;
		case ANDROID_WIFI_CMD_LINKSPEED :
			{
				u16 mbps = rtw_get_cur_max_rate(padapter)/10;
				sprintf(ext, "LINKSPEED %d", mbps);
			}
			break;
		case ANDROID_WIFI_CMD_MACADDR :
			sprintf(ext, "MACADDR = " MAC_FMT, MAC_ARG(dev->dev_addr));
			break;
		case ANDROID_WIFI_CMD_SCAN_ACTIVE :
			{
				//rtw_set_scan_mode(padapter, SCAN_ACTIVE);
				sprintf(ext, "OK");
			}
			break;
		case ANDROID_WIFI_CMD_SCAN_PASSIVE :
			{
				//rtw_set_scan_mode(padapter, SCAN_PASSIVE);
				sprintf(ext, "OK");
			}
			break;

		case ANDROID_WIFI_CMD_COUNTRY :
			{
				char country_code[10];
				sscanf(ext, "%*s %s", country_code);
				rtw_set_country(padapter, country_code);
				sprintf(ext, "OK");
			}
			break;
		default :
			#ifdef  CONFIG_DEBUG_RTW_WX_SET_PRIV
			DBG_871X("%s: %s unknowned req=%s\n", __FUNCTION__,
				dev->name, ext_dbg);
			#endif

			sprintf(ext, "OK");

	}

	if (copy_to_user(dwrq->pointer, ext, min(dwrq->length, (u16)(strlen(ext)+1)) ) )
		ret = -EFAULT;

	#ifdef CONFIG_DEBUG_RTW_WX_SET_PRIV
	DBG_871X("%s: %s req=%s rep=%s dwrq->length=%d, strlen(ext)+1=%d\n", __FUNCTION__,
		dev->name, ext_dbg ,ext, dwrq->length, (u16)(strlen(ext)+1));
	#endif
#endif //end of CONFIG_ANDROID


FREE_EXT:

	rtw_vmfree(ext, len);
	#ifdef CONFIG_DEBUG_RTW_WX_SET_PRIV
	rtw_vmfree(ext_dbg, len);
	#endif

	//DBG_871X("rtw_wx_set_priv: (SIOCSIWPRIV) %s ret=%d\n",
	//		dev->name, ret);

	return ret;

}
#ifdef CONFIG_WOWLAN
static int rtw_wowlan_ctrl(struct net_device *dev,
						struct iw_request_info *info,
						union iwreq_data *wrqu, char *extra)
{
	_adapter *padapter =  (_adapter *)rtw_netdev_priv(dev);
	struct wowlan_ioctl_param poidparam;
	struct pwrctrl_priv *pwrctrlpriv = adapter_to_pwrctl(padapter);
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	struct net_device *pnetdev = padapter->pnetdev;
#ifdef CONFIG_CONCURRENT_MODE
	struct net_device *pbuddy_netdev = padapter->pbuddy_adapter->pnetdev;
#endif
	struct sta_info	*psta = NULL;
	int ret = 0;
	u32 start_time = rtw_get_current_time();
	poidparam.subcode = 0;

	DBG_871X("+rtw_wowlan_ctrl: %s\n", extra);

	if(pwrctrlpriv->bSupportRemoteWakeup==_FALSE){
		ret = -EPERM;
		DBG_871X("+rtw_wowlan_ctrl: Device didn't support the remote wakeup!!\n");
		goto _rtw_wowlan_ctrl_exit_free;
	}

	if (!check_fwstate(pmlmepriv, _FW_LINKED) &&
			check_fwstate(pmlmepriv, WIFI_STATION_STATE)) {
			DBG_871X("[%s] WARNING: Please Connect With AP First!!\n", __func__);
			goto _rtw_wowlan_ctrl_exit_free;
	}

	if (_rtw_memcmp( extra, "enable", 6 )) {

		padapter->registrypriv.mp_mode = 1;

		while (pwrctrlpriv->bips_processing == _TRUE)
			rtw_msleep_os(1);

		rtw_ps_deny(padapter, PS_DENY_SUSPEND);

		rtw_cancel_all_timer(padapter);

#ifdef CONFIG_CONCURRENT_MODE
		if (padapter->pbuddy_adapter){
			rtw_cancel_all_timer(padapter->pbuddy_adapter);
		}
#endif // CONFIG_CONCURRENT_MODE

		LeaveAllPowerSaveModeDirect(padapter);

		rtw_stop_cmd_thread(padapter);

		rtw_ps_deny_cancel(padapter, PS_DENY_SUSPEND);

		rtw_suspend_wow(padapter);

	} else if (_rtw_memcmp( extra, "disable", 6 )) {
		rtw_resume_process_wow(padapter);
		padapter->registrypriv.mp_mode = 0;
	} else {
		DBG_871X("[%s] Invalid Parameter.\n", __func__);
		goto _rtw_wowlan_ctrl_exit_free;
	}
	//mutex_lock(&ioctl_mutex);
_rtw_wowlan_ctrl_exit_free:
	DBG_871X("-rtw_wowlan_ctrl( subcode = %d)\n", poidparam.subcode);
	DBG_871X_LEVEL(_drv_always_, "%s in %d ms\n", __func__,
			rtw_get_passing_time_ms(start_time));
_rtw_wowlan_ctrl_exit:
	return ret;
}
#endif //CONFIG_WOWLAN

#ifdef CONFIG_AP_WOWLAN
static int rtw_ap_wowlan_ctrl(struct net_device *dev,
						struct iw_request_info *info,
						union iwreq_data *wrqu, char *extra)
{
	_adapter *padapter =  (_adapter *)rtw_netdev_priv(dev);
	struct wowlan_ioctl_param poidparam;
	struct pwrctrl_priv *pwrctrlpriv = adapter_to_pwrctl(padapter);
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	struct sta_info	*psta = NULL;
	int ret = 0;
	u32 start_time = rtw_get_current_time();
	poidparam.subcode = 0;

	DBG_871X("+rtw_ap_wowlan_ctrl: %s\n", extra);

	if(pwrctrlpriv->bSupportRemoteWakeup==_FALSE){
		ret = -EPERM;
		DBG_871X("+rtw_wowlan_ctrl: Device didn't support the remote wakeup!!\n");
		goto _rtw_ap_wowlan_ctrl_exit_free;
	}

	if (!check_fwstate(pmlmepriv, WIFI_AP_STATE)) {
		DBG_871X("[%s] It is not AP mode!!\n", __func__);
		goto _rtw_ap_wowlan_ctrl_exit_free;
	}

	if (_rtw_memcmp( extra, "enable", 6 )) {
		pwrctrlpriv->wowlan_ap_mode = _TRUE;
		while (pwrctrlpriv->bips_processing == _TRUE)
			rtw_msleep_os(1);

		rtw_cancel_all_timer(padapter);

		padapter->bDriverStopped = _TRUE;	//for stop thread
		rtw_stop_drv_threads(padapter);
		padapter->bDriverStopped = _FALSE;	//for 32k command

#ifdef CONFIG_LPS
		LeaveAllPowerSaveModeDirect(padapter);
#endif
		rtw_hal_disable_interrupt(padapter); // It need wait for leaving 32K.

		// 2.1 clean interupt
		if (padapter->HalFunc.clear_interrupt)
			padapter->HalFunc.clear_interrupt(padapter);

		poidparam.subcode = WOWLAN_AP_ENABLE;

		rtw_hal_set_hwreg(padapter, HW_VAR_AP_WOWLAN,(u8 *)&poidparam);
	} else if (_rtw_memcmp( extra, "disable", 6 )) {
#ifdef CONFIG_LPS
		LeaveAllPowerSaveModeDirect(padapter);
#endif //CONFIG_LPS
		pwrctrlpriv->bFwCurrentInPSMode = _FALSE;

		rtw_hal_disable_interrupt(padapter);

		if (padapter->HalFunc.clear_interrupt)
			padapter->HalFunc.clear_interrupt(padapter);

		poidparam.subcode = WOWLAN_AP_ENABLE;

		rtw_hal_set_hwreg(padapter, HW_VAR_AP_WOWLAN,(u8 *)&poidparam);

		pwrctrlpriv->wowlan_ap_mode = _FALSE;

		psta = rtw_get_stainfo(&padapter->stapriv, get_bssid(&padapter->mlmepriv));
		if (psta) {
			set_sta_rate(padapter, psta);
		}

